/**
 * 자바스크립트(JavaScript)는 객체 기반의 스크립트 프로그래밍 언어입니다. 
 * 주로 웹 브라우저 내에서 사용하며, Node.js를 사용해서 서버 프로그래밍, 
 * 데스크탑, 임베디드, 키오스크 등에도 사용되고 있습니다.
 *  
 * 1.1 자바스크립트의 역사
 *  원래 모카(Mocha)라는 이름으로 개발되었으나 이 언어는 공식적으로 라이브스크립트(LiveScript)로 불렸으며 
 *  이 당시 1995년 9월 넷스케이프 내비게이터 2.0의 베타 릴리스가 이루어졌으나 나중에 이름이 자바스크립트로 
 *  바뀌었는데 이는 12월 넷스케이프 내비게이터 2.0 베타 3에 채용되었다. 이름의 최종 선정에 혼란이 야기되었는데 
 *  이 언어가 자바 프로그래밍 언어에서 파생되었다는 인상을 심었으며 이러한 선택이 마케팅적인 특징을 보였고 
 *  이는 넷스케이프가 당시 인기있는 웹 프로그래밍 언어로서 자바스크립트를 내밀기 위한 것이었다.
 * 
 * 1.2 ECMA Script란
 *  ECMA스크립트(ECMAScript, 또는 ES)란, Ecma International이 ECMA-262 기술 규격에 따라 정의하고 있는 
 *  표준화된 스크립트 프로그래밍 언어를 말한다. 자바스크립트를 표준화하기 위해 만들어졌다. 
 *  ECMA스크립트는 웹의 클라이언트 사이드 스크립트로 많이 사용되며 Node.js를 사용한 \
 *  서버 응용 프로그램 및 서비스에도 점차 많이 쓰이고 있다.
 * 
 * 1.3 바닐라 JS
 *  어떠한 라이브러리나 프레임워크를 쓰지 않는 순수 자바스크립트를 '바닐라JS'라고 부른다.
 *  현재 거의 모든 웹 애플리케이션은 jQuery, Angular, React, Vue 등 수많은 자바스크립트 라이브러리 및 
 *  프레임워크를 사용해 구축되고 있다. 그러다 보니 점점 복잡도가 증가하고 있고, 일부 기능을 사용하기 위해서
 *  전체 라이브러리를 추가하다 보니 애플리케이션은 점점 무거워지고 성능 역시 더 이상 보장할 수 없는 상태가
 *  되고 있다. 이런 시점에서 외부 라이브러리, 프레임워크를 사용하지 않고 순수 자바스크립트로 구현해서 가볍고,
 *  빠르고, 호환성이 좋은 웹 애플리케이션을 만들자는 움직임이 일어났다. 
 *  
 *  바닐라 JS 공식사이트(http://vanilla-js.com)
 *  
 *  Vanilla JS is a fast, lightweight, cross-platform framework
 *  for building incredible, powerful JavaScript applications.
 * 
 *   
 */